import { mergeProps, useSSRContext } from "vue";
import { ssrRenderAttrs } from "vue/server-renderer";
import { _ as _export_sfc } from "../server.mjs";
import "ofetch";
import "#internal/nuxt/paths";
import "hookable";
import "unctx";
import "h3";
import "unhead";
import "@unhead/shared";
import "vue-router";
import "radix3";
import "defu";
import "ufo";
import "devalue";
import "@vue/devtools-api";
import "destr";
import "klona";
import "@formkit/auto-animate/vue";
import "@vueuse/core";
import "tailwind-merge";
import "@iconify/vue";
import "axios";
import "mitt";
import "vue-recaptcha-v3";
const _sfc_main = {
  head() {
    return {
      title: "Договір з надання інформаційних послуг"
    };
  }
};
function _sfc_ssrRender(_ctx, _push, _parent, _attrs, $props, $setup, $data, $options) {
  _push(`<div${ssrRenderAttrs(mergeProps({ class: "contract bg-white" }, _attrs))} data-v-f1620c46><h1 data-v-f1620c46>ДОГОВІР З НАДАННЯ ІНФОРМАЦІЙНИХ ПОСЛУГ</h1><p class="subtitle" data-v-f1620c46>(НА ОСНОВІ ПУБЛІЧНОЇ ОФЕРТИ)</p><p data-v-f1620c46> БО “Благодійний фонд соціальних реформ та підтримки &quot;Надія”, в подальшому «Виконавець» пропонує будь-якій фізичній або юридичній особі (надалі – «Замовник») укласти договір про надання інформаційних послуг на наступних умовах: </p><h2 data-v-f1620c46>ВИКОРИСТАНІ ТЕРМІНИ:</h2><p data-v-f1620c46><strong data-v-f1620c46>ПУБЛІЧНА ОФЕРТА</strong> – пропозиція «Виконавця», викладена на веб-сайті: <a href="http://cfhope.in.ua/" data-v-f1620c46>http://cfhope.in.ua/</a>, адресована невизначеному колу фізичних осіб, укласти договір на визначених умовах. </p><p data-v-f1620c46><strong data-v-f1620c46>ДОГОВІР</strong> - договір про надання інформаційних послуг, укладений між Замовником та Виконавцем на умовах публічної оферти в момент акцепту замовником її умов. </p><p data-v-f1620c46><strong data-v-f1620c46>АКЦЕПТ</strong> - повне та безумовне, беззастережне прийняття Замовником умов публічної оферти. Моментом акцепту вважається заявка Замовника на отримання інформаційних послуг. </p><p data-v-f1620c46><strong data-v-f1620c46>ПОСЛУГА</strong> - надання виконавцем замовнику інформаційних послуг у сфері інформатизації. </p><p data-v-f1620c46><strong data-v-f1620c46>ЗАЯВКА</strong> - звернення Замовника до Виконавця, здійснене шляхом телефонного дзвінка, електронного повідомлення. </p><h2 data-v-f1620c46>1. ПРЕДМЕТ ДОГОВОРА</h2><p data-v-f1620c46> 1.1. Предметом даного договору є послуга з надання виконавцем замовнику інформаційного консультування з питань інформатизіції: розкриття інформації з основ Алгоритмізації і програмування, дискретної математики, розробки та аналізу алгоритмів, елементарної та вищої математики, баз даних, комп&#39;ютерних мереж, ООП, інтернет-програмування, програмування під мобільні платформи, сучасні технології розробки програмних продуктів, англійської мови для програмістів тощо. </p><p data-v-f1620c46> 1.2. Замовник зобов&#39;язується прийняти послуги, що надаються, і оплатити їх. </p><p data-v-f1620c46> 1.3. З урахуванням того, що текст цього Договору є публічною офертою (пропозицією укласти договір), Замовник і Виконавець визнають, що ухваленням пропозиції укласти договір є факт оформлення сторонами бланка заявки (Акцепту) з основними вимогами Замовника (тематичне завдання), в процесі оформлення якого Замовник повідомляє свої реквізити і приймає текст цього Договору. </p><h2 data-v-f1620c46>2. ВАРТІСТЬ ПОСЛУГ І ПОРЯДОК ЇХ ОПЛАТИ</h2><p data-v-f1620c46>2.1. Вартість робіт за даною угодою визначається Виконавцем.</p><p data-v-f1620c46>2.2. Форма оплати: готівковий або безготівковий розрахунок.</p><p data-v-f1620c46> 2.3. Заявлена вартість послуг є попередньою і може бути змінена в односторонньому порядку Виконавцем залежно від терміновості, складності, об&#39;єму здійснюваних дій і можливостей Виконавця. </p><p data-v-f1620c46> 2.4. У випадках, коли неможливість виконання виникла з обставин, за які жодна із сторін не відповідає. Замовник відшкодовує Виконавцеві фактично понесені ним витрати. </p><h2 data-v-f1620c46>3. ПРАВА І ОБОВ&#39;ЯЗКИ ЗАМОВНИКА</h2><p data-v-f1620c46><strong data-v-f1620c46>3.1. Обов&#39;язки Замовника</strong></p><p data-v-f1620c46> 3.1.1. Замовник зобов&#39;язується провести своєчасну оплату послуг Виконавця. </p><p data-v-f1620c46> 3.1.2. Замовник зобов&#39;язаний здійснити всі інші дії, необхідні для виконання даного договору, передбачені законодавством і цим договором. </p><p data-v-f1620c46><strong data-v-f1620c46>3.2. Права Замовника</strong></p><p data-v-f1620c46> 3.2.1. Замовник має право за наявності конкретних питань (уточнюючі, деталізуючі) звернутися за консультацією. </p><h2 data-v-f1620c46>4. ПРАВА І ОБОВ&#39;ЯЗКИ ВИКОНАВЦЯ</h2><p data-v-f1620c46><strong data-v-f1620c46>4.1. Права Виконавця</strong></p><p data-v-f1620c46> 4.1.1. Виконавець має право не надавати послуги, а початі дії з надання послуг припинити у випадках, коли порушення Замовником своїх обов&#39;язків за даною угодою у відповідність з п.3.1.1 - п.3.1.2. </p><p data-v-f1620c46> 4.1.2. Виконавець має право самостійно визначати способи і об&#39;єм дій з виконання завдання Замовника, враховуючи вимоги завдання Замовника. </p><p data-v-f1620c46> 4.1.3. Виконавець має право використовувати і розпоряджатися результатами власної діяльності з надання інформаційних послуг, наданими Замовникові за власним розсудом, у тому числі і надавати їх третім особам. </p><p data-v-f1620c46><strong data-v-f1620c46>4.2. Обов&#39;язки Виконавця</strong></p><p data-v-f1620c46> 4.2.1. Виконавець зобов&#39;язується надати передбачені цим Договором послуги. </p><h2 data-v-f1620c46>5. ЗАБЕЗПЕЧЕННЯ ВИКОНАННЯ ЗОБОВ&#39;ЯЗАНЬ І ВІДПОВІДАЛЬНІСТЬ СТОРІН</h2><p data-v-f1620c46> 5.1. Виконавець не несе відповідальності за спричинення збитків Замовникові, а також спричинення йому моральної шкоди діями третіх осіб в результаті невиконання Замовником навчального плану відповідного учбового закладу. </p><h2 data-v-f1620c46>6. ЯКІСТЬ ПОСЛУГ І ПОРЯДОК ПРЕД&#39;ЯВЛЕННЯ ПРЕТЕНЗІЙ</h2><p data-v-f1620c46> 6.1. Замовник не має права пред&#39;являти Виконавцеві вимог щодо неналежної якості наданих послуг у разі відсутності позитивного для Замовника результату. </p><p data-v-f1620c46> 6.2. Виконавець несе відповідальність за достовірність результатів своєї діяльності з надання інформаційних послуг. </p><p data-v-f1620c46> 6.3. Всі претензії Замовника з приводу якості наданих Виконавцем послуг пред&#39;являються письмово з вказівкою переліку конкретних дій, які необхідно зробити Виконавцеві. Претензії без вказівки переліку доопрацювань розгляду не підлягають. </p><h2 data-v-f1620c46>7. ІНШІ УМОВИ</h2><p data-v-f1620c46> 7.1. Не допускається передача Замовником своїх прав та обов&#39;язків за цим Договором третім особам без письмового погодження з Виконавцем. </p><p data-v-f1620c46> 7.2. Замовник дає свою згоду Виконавцю на використання та обробку його персональних данних в рамках чинного законодавства України. </p><h2 data-v-f1620c46>8. КОНТАКТНІ ДАНІ ВИКОНАВЦЯ</h2><p data-v-f1620c46><a href="https://cfhope.in.ua/" data-v-f1620c46>https://cfhope.in.ua/</a></p><p data-v-f1620c46>E-mail: <a href="mailto:boss@cfhope.in.ua" data-v-f1620c46>boss@cfhope.in.ua</a></p><p data-v-f1620c46>Телефон: +38(098) 765-43-21</p></div>`);
}
const _sfc_setup = _sfc_main.setup;
_sfc_main.setup = (props, ctx) => {
  const ssrContext = useSSRContext();
  (ssrContext.modules || (ssrContext.modules = /* @__PURE__ */ new Set())).add("pages/terms.vue");
  return _sfc_setup ? _sfc_setup(props, ctx) : void 0;
};
const terms = /* @__PURE__ */ _export_sfc(_sfc_main, [["ssrRender", _sfc_ssrRender], ["__scopeId", "data-v-f1620c46"]]);
export {
  terms as default
};
//# sourceMappingURL=terms-CcQW4qVX.js.map
