<template>
  <main class="knd-main">
    <div class="page-header">
      <div class="container">
        <div class="text-column">
          <h1 class="page-title">Умови сервісу сбору пожертв</h1>
        </div>
      </div>
    </div>

    <div class="page-content container">
      <div class="entry-content the-content text-column">
        <p>ДОГОВІР публічної оферти про надання благодійної пожертви</p>
        <p>
          Ця публічна оферта про надання благодійної пожертви (надалі – Оферта)
          адресована невизначеному колу осіб – фізичним та юридичним особам
          (надалі – Благодійник), що є відвідувачами сайту в мережі Інтернет:
          https://cfhope.in.ua (надалі – Сайт), і є офіційною і публічною
          пропозицією Благодійної організації "Благодіний фонд соціальних реформ
          та підтримки "Надія" (Ідентифікаційний код юридичної особи 26220897),
          в особі Директора Мелешко Олександра Миколайовича, який діє на
          підставі Статуту (надалі – Фонд), укласти договір про надання
          благодійної пожертви (надалі – Договір), предмет та істотні умови
          якого вказані нижче:
        </p>
        <p>1. Терміни та визначення</p>
        <p>
          1.1. Публічна оферта (та/або Оферта) – дійсна пропозиція Фонду,
          розміщена на Сайті, про надання благодійної пожертви, адресована
          необмеженому колу осіб, у тому числі Благодійнику.
        </p>
        <p>
          1.2. Акцепт – повне і безумовне прийняття Публічної оферти шляхом
          вчинення дій із здійснення грошового переказу за допомогою платіжних
          форм та засобів, розміщених на Сайті, а також шляхом перерахування
          грошових коштів на розрахунковий рахунок Фонду через установи банків.
          Моментом Акцепту є дата зарахування грошових коштів на банківський
          розрахунковий рахунок Фонду.
        </p>
        <p>
          1.3. Благодійна пожертва – безоплатна передача Благодійником коштів у
          власність Фонду для наступного використання для досягнення цілей
          Фонду, передбачених Статутом або програмами Фонду, відповідно до
          Закону України «Про благодійну діяльність та благодійні організації»,
          Статуту Фонду та цього Договору.
        </p>
        <p>
          1.4. Благодійник – дієздатна фізична чи юридична особа, яка
          добровільно здійснює один чи декілька видів благодійної діяльності.
          Для цілей цього Договору Благодійником є фізична та/або юридична
          особа, яка акцептувала Оферту.
        </p>
        <p>2. Предмет договору</p>
        <p>
          2.1. Предметом цього Договору є безоплатна та добровільна передача
          Благодійником у власність Фонду грошових коштів шляхом здійснення
          благодійної пожертви на здійснення статутної діяльності Фонду, в тому
          числі (але не виключно) з надання благодійної допомоги обдарованим
          дітям, дітям з інвалідністю, дітям-сиротам та позбавленим
          батьківського піклування, дітям учасників операції об'єднаних сил (ООС
          / АТО) та вимушених переселенців, дітям, які проживають у зоні
          військового конфлікту на сході України, в рамках програм Фонду та
          проектів у сфері культури, освіти, охорони здоров'я, духовного і
          фізичного розвитку особистості відповідно до Закону України «Про
          благодійну діяльність та благодійні організації».
        </p>
        <p>2.2. Благодійник самостійно визначає розмір благодійної пожертви.</p>
        <p>
          2.3. Предметом цього Договору не є отримання прямо чи опосередковано
          прибутку жодною зі сторін цього Договору.
        </p>
        <p>3. Акцепт</p>
        <p>
          3.1. Акцепт Оферти означає, що Благодійник згоден з усіма його
          положеннями, розуміє та погоджується з тим, що пожертва буде
          використана на досягнення цілей, передбачених Статутом Фонду, з яким
          він може ознайомитися, надіславши запит на електронну адресу
          boss@cfhope.in.ua. Крім того, Благодійник у повній мірі усвідомлює та
          згоден з предметом Договору щодо мети публічного збору пожертв та
          права Фонду використовувати частину Благодійної пожертви Благодійника
          на адміністративні витрати Фонду, у розмірі не більшому, ніж це
          передбачено законодавством України.
        </p>
        <p>
          3.2. Благодійник та Фонд, керуючись ст.ст. 207, 639, 641, 642
          Цивільного кодексу України, ст.ст. 6 та 7 Закону України «Про
          благодійну діяльність та благодійні організації», погоджуються, що з
          моменту Акцепту Договір вважається укладеним у письмовій формі. При
          цьому Сторони погоджуються, що недодержання сторонами письмової форми
          правочину, не має наслідком його недійсність.
        </p>
        <p>4. Права та обов’язки Фонду</p>
        <p>
          4.1. Фонд має право:<br />
          – отримувати Благодійні пожертви та використовувати їх відповідно до
          предмету та умов цього Договору;<br />
          – за погодженням із Благодійником змінювати напрямки використання
          пожертви, крім використання пожертви в рамках одного цільового
          призначення, тобто однієї благодійної програми, у випадках, зазначених
          у ч. 8.3. розділу 8 цього Договору;<br />
          – без погодження із Благодійником використовувати частину Благодійної
          пожертви на адміністративні витрати Фонду, у розмірі не більшому, ніж
          це передбачено законодавством України.
        </p>
        <p>
          4.2. Фонд зобов’язаний:<br />
          – щорічно в електронному вигляді розміщувати звіти про використання
          пожертв на Сайті Фонду за посиланням: https://cfhope.in.ua;<br />
          – використовувати отримані пожертви виключно для досягнення цілей,
          передбачених Статутом Фонду.
        </p>
        <p>
          5. Права Благодійника<br />
          Благодійник має право:<br />
          – здійснювати контроль за цільовим використанням благодійної
          пожертви;<br />
          – у встановленому законом порядку змінити бенефіціарів (отримувачів)
          благодійної пожертви у разі порушення цілей, строків та порядку
          використання такої пожертви або її частини відповідно до умов цього
          Договору.
        </p>
        <p>6. Місце проведення публічного збору коштів</p>
        <p>
          Публічний збір Благодійної пожертви здійснюється на території будь-
          якої країни світу. Безпосередня діяльність Фонду щодо публічного збору
          пожертв за даним Договором проводиться за місцезнаходженням Фонду.
        </p>
        <p>7. Строк збору пожертв</p>
        <p>
          Публічний збір пожертв триває до моменту ліквідації Фонду, якщо інший
          строк не буде визначено Фондом.
        </p>
        <p>8. Порядок використання благодійних пожертв</p>
        <p>
          8.1. Використання зібраних за даним Договором Благодійних пожертв
          проводиться відповідно до цілей благодійної діяльності Фонду.
        </p>
        <p>
          8.2. Благодійник або уповноважені ним особи мають право здійснювати
          контроль за цільовим використанням благодійної пожертви, у тому числі
          на користь третіх осіб.
        </p>
        <p>
          8.3. Благодійник надає згоду на використання благодійної пожертви в
          рамках її цільового призначення, тобто в рамках однієї благодійної
          програми. У разі закриття чи неактуальності збору коштів на окремий
          проект, благодійну акцію чи благодійний захід, що діє в рамках
          конкретної благодійної програми, Благодійник надає згоду на
          використання Фондом благодійної пожертви на реалізацію іншого проекту,
          благодійної акції чи благодійного заходу, що діє в рамках цієї ж
          благодійної програми, без додаткового погодження з Благодійником.
        </p>
        <p>
          8.4. Зміна цілей та порядку використання благодійної пожертви можлива
          за згодою Благодійника або його правонаступників, а також на підставі
          рішення суду чи в інших випадках, визначених законом, крім випадків,
          зазначених у ч. 8.3. розділу 8 цього Договору.
        </p>
        <p>
          8.5. Отримані Фондом пожертви можуть бути повернені Благодійнику
          виключно у випадках, передбачених законодавством України.
        </p>
        <p>
          8.6. Відповідальність сторін за порушення цього Договору або порядку
          використання Благодійних пожертв передбачено вимогами чинного
          законодавства України.
        </p>
        <p>9. Порядок загального доступу до фінансових звітів Фонду</p>
        <p>
          9.1. Доступ до фінансових звітів Фонду здійснюється шляхом щорічного
          їх розміщення Фондом на Сайті в електронному вигляді.
        </p>
        <p>
          9.2. Інша інформація може надаватися Фондом у порядку та в строки
          передбачені законодавством України.
        </p>
        <p>10. Інші умови</p>
        <p>
          10.1. Всі витрати по сплаті сум (комісій), пов’язаних із
          перерахуванням та зарахуванням Благодійної пожертви, несе Благодійник.
        </p>
        <p>
          10.2. Благодійник шляхом здійснення Акцепту підтверджує, що він
          ознайомлений та згоден з умовами Додатку № 1 до цього Договору щодо
          збирання та обробки персональних даних.
        </p>
        <p>
          10.3. Благодійник надає згоду на те, що після внесення інформації про
          себе на сайті Фонду та здійснення реєстрації на сайті, його контактна
          інформація може бути використана Фондом для направлення листів та
          повідомлень, в тому числі в електронному вигляді. При цьому, Фонд
          зобов’язується не надавати інформацію про контактні дані Благодійника
          третім особам, крім випадків, прямо передбачених законодавством
          України. Крім того, Благодійник надає свою згоду, що інформація про
          нього (зокрема, прізвище, ім’я, по батькові) може бути використана
          (виключно за його додатковою згодою) Фондом в засобах масової
          інформації, на сайті Фонду або його соціальних мережах.
        </p>
        <p>11. Місцезнаходження та банківські реквізити</p>
        <p>
          Благодійний фонд соціальних реформ та підтримки "Надія"<br />
          ЄДРПОУ 26220897<br />
          86065, Донецька область, м.Авдіївка, вул.Нечаєва, 16<br />
          https://cfhope.in.ua boss@cfhope.in.ua
        </p>
        <p>
          АТ "Приватбанк"<br />
          р/р&nbsp;&lt;span style="font-family: Calibri, sans-serif; font-size:
          11pt; color:
          var(–knd-color-base);"&gt;UA813354960000026007051602289&lt;/span&gt;
        </p>
        <p>#LEGAL_FACE_POSITION# #LEGAL_FACE#</p>
      </div>
    </div>
  </main>
</template>

<style scoped></style>
