<template>
  <section class="max-w-7xl mx-auto px-4 py-8">
    <h1 class="text-4xl font-bold text-center mb-8">Як допомогти</h1>

    <div class="mb-6">
      <h2 class="text-2xl font-semibold">Ми шукаємо волонтерів!</h2>
      <p class="mt-2 text-lg">
        Для розвитку нашого геопорталу ми шукаємо волонтерів, які допоможуть
        зробити його кориснішим для суспільства. Особливо нам потрібні:
      </p>
      <ul class="list-disc list-inside mt-4 space-y-2 text-lg">
        <li>
          <strong>Дизайнери</strong> — для покращення користувальницького
          інтерфейсу та загального візуального оформлення.
        </li>
        <li>
          <strong>Тестувальники</strong> — для забезпечення якості роботи
          порталу та виявлення помилок.
        </li>
      </ul>
      <p class="mt-2 text-lg">
        Якщо ви початківець, але маєте цікаві ідеї та бажання розвиватись в
        команді - звертайтесь до нас, це гарна можливість напрацювати власне
        портфоліо. Функціональний сайт з потужною соціальною метою стане гарним
        приводом для ваших майбутніх роботодавців звернути увагу на вас і ваші
        здібності, цінності та мотивацію.
      </p>
    </div>

    <div class="mb-6">
      <h2 class="text-2xl font-semibold">Фінансова підтримка</h2>
      <p class="mt-2 text-lg">
        Ваші пожертвування допоможуть сплачувати нам за послуги та
        інфраструктуру, необхідні для подальшого розвитку проекту. Ми будемо
        вдячні за будь-яку фінансову підтримку та поширення!
      </p>
    </div>

    <div class="bg-gray-100 p-6 rounded-lg shadow-md">
      <h3 class="text-xl font-bold">Приєднуйтесь до нашого проекту!</h3>
      <p class="mt-2 text-lg">
        Якщо ви хочете стати частиною нашої команди або надати фінансову
        підтримки, зв'яжіться з нами. Ми будемо раді будь-якому внеску,
        незалежно від вашого досвіду чи можливостей!
      </p>
      <p class="mt-2 text-lg">
        Якщо ви хочете дізнатись більше про нашу команду:
        <NuxtLink
          to="https://cfhope.in.ua"
          class="text-blue-500 underline hover:text-blue-700"
        >
          Благодійний фонд соціальних реформ та підтримки "Надія" </NuxtLink
        >.
      </p>
    </div>
  </section>
</template>

<script setup></script>

<style scoped></style>
