/**
 * @param { import("knex").Knex } knex
 * @returns { Promise<void> }
 */

const memoriesData = [
    {
      source_type: 'site',
      source_url: 'https://takflix.com/uk/films/narodnyy-muzey-avdiyivky',
      title: 'Народний музей Авдіївки',
      address: 'м. Авдіївка, вул. Комунальна, 11',
      location: 'SRID=4326;POINT(37.7421459 48.1332797)',
      date_event: '2018-01-01T20:38:01.896Z',
      description:
        'Головна експозиція музею в Авдіївці була присвячена Кавказу. У 2015 році в музей влучили російські снаряди, що знищили частину експозиції. Але тепер в Авдіївці знову є народний музей – місце, де оживають найдивніші ідеї. Режисер фільму «Новий дім» Богдан Приходько.',
      user_id: 1,
      published: true,
    },
    {
      source_type: 'youtube',
      source_url: 'https://www.youtube.com/shorts/O-bghfdafeA',
      title: 'Лариса, я в Авдеевке!',
      address: 'м. Авдіївка, вул. Грушевського, 75',
      location: 'SRID=4326;POINT(37.741756 48.139113)',
      date_event: '2024-03-17T20:38:01.896Z',
      description:
        'Лариса, я в Авдеевке! Тут в этих домах все есть. Телевизоры, чего только нету! Только надо электричку какую-то грузовую и вывозить отсюда! Российский мародер "освободил" жителей Донбасса от жизни и теперь пожинает плоды своего "спасения".',
      user_id: 1,
      published: true,
    },
    {
      source_type: 'youtube',
      source_url: 'https://www.youtube.com/shorts/TI72SnsTBcY',
      title: 'Росіянка приїхала в тимчасово окуповану Авдіївку МАРОДЕРИТИ',
      address: 'м. Авдіївка, вул. Комунальна, 6',
      location: 'SRID=4326;POINT(37.736276 48.134164)',
      date_event: '2024-03-17T20:38:01.896Z',
      description:
        'Росіянка приїхала в тимчасово окуповану Авдіївку МАРОДЕРИТИ',
      user_id: 1,
      published: true,
    },
    {
      title: "З історії одного пам'ятника",
      address: 'м. Авдіївка, Бульвар Шевченка',
      location: 'SRID=4326;POINT(37.7415025 48.1324508)',
      description: `Чи багато в Україні міст та містечок, в яких немає пам’ятника Великому Кобзарю – Тарасу Григоровичу Шевченку? Тож і Авдіївка не є виключенням. Пам’ятник поету знаходиться на бульварі, що носить його ім’я. 
Відлитий із бронзи бюст Шевченка, встановлений на залізобетонному постаменті, облицьованій гранітною плиткою, - прикрашає центр бульвару, який є улюбленим місцем відпочинку авдіївців. 
Та виявляється в Авдіївці пам’ятник поету відкривали двічі. Та ще двічі міняли місце його розташування.
Перший пам’ятник встановили в радянські часи під час розбудови алеї, що веде до авдіївської школи № 6.
На жаль, точний рік його встановлення невідомий. Розглядаючи фото 70-х років минулого століття, можна побачити, що бюст Шевченка скоріш за все був вилитий із бетону та встановлений на високому постаменті, на тлі якого була встроєна табличка із рядками віршів: «Думи мої, думи мої…». Знаходився пам’ятник у центрі бульвару, навколо якого була розбита клумба з висадженими квітами. 
Історія життя другого пам’ятника розпочинається з 90-х років ХХ ст.. У листопаді 1990 року в Авдіївці відбулася видатна подія – урочисте відкриття пам’ятника Тарасу Шевченку, бюст якого був відлитий із бронзи. Ця подія знайшла відображення в місцевій газеті «Красное знамя» за 10 листопада 1990 року, виявляється - це був п’ятий за рахунком пам’ятник, відкритий того часу в Донецькій області. 
Та історія пам’ятника на цьому не закінчується. Під час реконструкції бульвару Шевченка пам’ятник був перенесений на початок алеї, що пересікається з проспектом К. Маркса (нині проспект Центральний). Бюст Шевченка поставлений на новий постамент, а на місці колишнього пам’ятника спорудили фонтан.
Тут пам’ятник Шевченку простояв до 2008 року. За цей час постамент поступово руйнувався та став виглядати неестетично, згодом перестав функціонувати і фонтан. Тож було прийняте рішення перенести пам’ятник на історичне місце – у центр бульвару - на місце вже колишнього фонтану. Постамент пам’ятника знову змінив зовнішній вигляд – був обкладений червоною керамічною плиткою, а навколо висаджені квіти. 
Оновлення пам’ятника Т. Шевченку відбулось у 2016 році та приурочене до 25-ї річниці Незалежності України. Постамент пам’ятника та парапет облицьовано гранітною плитою, споруджені невисокі східці, що ведуть до підніжжя пам’ятника. За оцінками містян, сучасний вигляд пам’ятника –найкращий за усі часи його встановлення.
Відділ культури
18.04
`,
      user_id: 1,
      published: true,
    },
    {
      source_type: 'facebook',
      source_url:
        'https://www.facebook.com/100012226445753/videos/613483121126444/',
      title: 'Авдіївська загальноосвітня школа І-ІІІ ступенів №7',
      address:
        'м. Авдіївка, Авдіївська загальноосвітня школа І-ІІІ ступенів №7.',
      location: 'SRID=4326;POINT(37.7351189 48.1330004)',
      user_id: 1,
      published: true,
    },
    {
      source_type: 'youtube',
      source_url: 'https://youtu.be/9uJQGwppqnE?si=yMqALzRmLEgR6IVs',
      title: '«Точка і краєвид: Народний музей Авдіївки» / Пьотр Армяновський',
      address: 'м. Авдіївка, вул. Комунальна, 11',
      location: 'SRID=4326;POINT(37.7426717 48.1333477)',
      date_event: '2021-01-28T20:38:01.896Z',
      description: `«Точка і краєвид: Народний музей Авдіївки» – виставковий проєкт митця та режисера Пьотра Армяновського у колаборації з художницями Народного музею, серед яких Христина Скрипниченко, Ольга Корба, Лілія Мережко, Зугайрат Новікова, Даша Бережна та Діана Паліна. Проєкт презентує роботи учасниць музею, відеоінтерв'ю з ними та відеороботу Армяновського «Народний музей Авдіївки», яка була до цього експонована та зайняла призове місце на конкурсі МУХі 2019. Також у проєкті будуть представлені відео-інтерв'ю однієї з організаторок фестивалю «Авдіївка FM» Тетяни Переверзєвої та німецького митця Алана Меєра, який багато разів приїздив до Авдіївки для проведення майстер-класів та пленерів.

Продовжуючи попередньо розпочату наративну лінію знайомства з прифронтовим музеєм у відео «Народний музей Авдіївки», нові роботи, зібрані у групове висловлювання, виступають одночасно і тематичним продовженням, і самостійним проєктом. Персоніфікований образ музею з відео Армяновського, який раніше оповідав свою тривалу історію від походів його завідувача з підлітками на Кавказ до військових обстрілів у часи нинішнього конфлікту, тепер виступає в образах його учасників.

Довготривала робота митця з музеєм розпочалася з відвідування фестивалю «Авдіївка ФМ», події якого відбувалися у Народному музеї та інших локаціях. Тоді його інтенція брати участь у театральній частині переросла у прагнення зафіксувати вир життя культурного центру у відео. У новому проєкті Пьотр Армяновський займає роль не тільки митця, який презентує відеонаратив, а й медіатора: між локальним авдіївським музеєм та його видимістю у міжрегіональному мистецькому контексті й між тамтешніми художницями та тутешніми відвідувачами проєкту.

Зі свого боку назва виставки, – «Точка і краєвид», збирає собою поєднання точок на шляху до зустрічі з останньою – Народним музеєм. Як коментує Пьотр: «Точка – як те, з чого складається картина. Також точка – це місце, яке потрібне художнику і глядачу, щоб побачити краєвид, зустрітися один з одним, перевернути світ». І саме тоді, коли таким пунктом зустрічі на мапі культурного краєвиду є Народний музей, Авдіївка, зі свого боку, є межовим пунктом на мапі конфлікту. Межовою точкою, яка за ініціативою місцевих дієвців, конвертується у точку повернення до життя.

Пьотр Армяновський 
Перформер та режисер, співзасновник групи Pic Pic. Вивчав театр та мистецтво перформансу у Києві, Львові та Москві включно зі «Школою перформансу» Янушa Бaгдиґи та «В присутності художника» Мaрини Aбрaмович. Після початку військового конфлікту у рідному місті Пьотр працює переважно з документальним кіно та театром. Бере участь у виставках і проєктах в Україні, Польщі, Угорщині, Франції та Іспанії.

Щербенко Арт Центр
Заснований галеристкою і кураторкою Мариною Щербенко. Завдання центру — створити можливості для діалогу між представниками світу мистецтва і широкою аудиторією. Центр займається виставковою діяльністю, а також виступає майданчиком для проведення лекцій, круглих столів та воркшопів з провідними майстрами сучасного мистецтва України та інших країн.

Відео автора P Perzan з Pexels
Трек із фонотеки Ютуб: William Tell Overture (by Rossini) – Rossini.`,
      user_id: 1,
      published: true,
    },
  ],
  memoryPhotosData = [
    {
      memory_id: 1,
      url: '/memoryimg/avd-narodniy-muzey.png',
    },
    {
      memory_id: 4,
      url: '/memoryimg/avd-shevchenko-1.jpg',
    },
    {
      memory_id: 4,
      url: '/memoryimg/avd-shevchenko-2.jpg',
    },
    {
      memory_id: 4,
      url: '/memoryimg/avd-shevchenko-3.jpg',
    },
  ];

const memoryHashtagsData = [
  { memory_id: 1, hashtag_name: 'культура' },
  { memory_id: 2, hashtag_name: 'мародери' },
  { memory_id: 2, hashtag_name: 'злочини' },
  { memory_id: 3, hashtag_name: 'мародери' },
  { memory_id: 3, hashtag_name: 'злочини' },
  { memory_id: 4, hashtag_name: 'культура' },
  { memory_id: 5, hashtag_name: 'культура' },
  { memory_id: 6, hashtag_name: 'культура' },
];

export const seed = async (knex) => {
  const seedExist = await knex('memories').select('*').where({ id: 7 });

  if (!seedExist[0]) {
    const trx = await knex.transaction();

    try {
      await trx('memories').insert(memoriesData);
      console.log('Inserted memories');
      await trx('memory_photos').insert(memoryPhotosData);
      console.log('Inserted memory_photos');

      for (const { memory_id, hashtag_name } of memoryHashtagsData) {
        const [hashtag] = await trx('hashtags').where({ name: hashtag_name });
        if (hashtag) {
          await trx('memory_hashtags')
            .insert({
              memory_id,
              hashtag_id: hashtag.id,
            })
            .onConflict(['memory_id', 'hashtag_id'])
            .ignore();
        }
      }

      await trx.commit();
    } catch (error) {
      await trx.rollback();
      throw new Error(`Failed migration for fill seed data: ${error.message}`);
    }
  }
};
